[
  {
    "category": "建筑结构与工艺术语",
    "terms": [
      {
        "name": "榫卯",
        "pinyin": "sǔn mǎo",
        "definition": "中国传统木构建筑中无需钉子的连接方式，通过凸出的“榫头”与凹进的“卯眼”咬合，实现构件间的稳固结合。",
        "application": "故宫太和殿的斗拱、梁柱均采用榫卯结构，1976年唐山地震时，其柔性连接有效缓冲了地震力，使建筑完好无损。",
        "extension": "可对比西方石砌建筑的“刚性连接”，强调中国建筑“以柔克刚”的智慧。"
      },
      {
        "name": "偷心造/计心造",
        "definition": "斗拱构造术语。“偷心造”指斗拱中某些拱件不直接承托上层构件，形成空缺；“计心造”则所有拱件均完整承托，结构更严密。",
        "application": "天坛祈年殿的斗拱采用“计心造”，体现皇家建筑的严谨；而先农坛太岁殿的斗拱则部分“偷心”，展现功能与美学的平衡。",
        "extension": "可引申为“留白”与“充实”的哲学对比。"
      },
      {
        "name": "举架",
        "pinyin": "jǔ jià",
        "definition": "中国传统建筑屋顶坡度的设计方法，通过逐层抬高椽子高度，形成舒缓或陡峭的屋面曲线。",
        "application": "故宫角楼的屋顶举架陡峭，形成“如翼舒展”的飞檐；而太庙的屋顶举架平缓，彰显庄重肃穆。",
        "extension": "清代规范中，五举（举高与跨度比为1:2）为常用坡度，太和殿屋顶举架达七举，凸显皇家气派。"
      }
    ]
  },
  {
    "category": "历史遗存与考古术语",
    "terms": [
      {
        "name": "土作/木作/瓦作",
        "definition": "中国古代建筑营造的三大工种。“土作”负责地基与墙体，“木作”主攻梁架与斗拱，“瓦作”专精屋面与装饰。",
        "application": "景山五亭的修缮中，需协调“木作”修复斗拱、“瓦作”更换琉璃瓦、“土作”加固台基，体现传统工艺的系统性。",
        "extension": "可提及当代“非遗传承人”如何复原这些技艺。"
      },
      {
        "name": "版筑",
        "pinyin": "bǎn zhù",
        "definition": "古代夯土建筑技术，用两块木板夹土，逐层夯实成墙，常见于城墙与台基。",
        "application": "正阳门箭楼的城墙即采用版筑法，其夯土层厚度达15厘米，历经数百年仍坚固如初。",
        "extension": "可邀请游客触摸复原的“夯土样本”，感受古代工艺的质感。"
      },
      {
        "name": "须弥座",
        "pinyin": "xū mí zuò",
        "definition": "源自印度佛教的台基形式，层层叠涩如须弥山，象征神圣与稳固，后成为中国皇家建筑的标准台基样式。",
        "application": "天坛祈年殿的汉白玉须弥座高3.8米，雕刻“缠枝莲”纹样，体现“天圆地方”的宇宙观。",
        "extension": "可对比普通建筑的石台基，强调须弥座的等级象征。"
      }
    ]
  },
  {
    "category": "文化符号与哲学术语",
    "terms": [
      {
        "name": "五门三朝",
        "definition": "《周礼》记载的古代都城礼制，指皇城设五道门（皋门、库门、雉门、应门、路门），宫殿分三朝（外朝、治朝、燕朝），用于不同等级的礼仪活动。",
        "application": "天安门（皋门）、端门（库门）、午门（雉门）、太和门（应门）、乾清门（路门）构成“五门”；太和殿（外朝）、乾清宫（治朝）、养心殿（燕朝）对应“三朝”。",
        "extension": "此布局为元大都首创，明清北京城继承并完善，成为世界城市规划史的典范。"
      },
      {
        "name": "左祖右社",
        "definition": "《周礼》规定的都城布局，左（东）侧设太庙祭祀祖先，右（西）侧建社稷坛祭祀土地神与谷物神，体现“敬天法祖”的伦理观。",
        "application": "故宫东侧的太庙与西侧的社稷坛严格对称，太庙的“燎炉”用于焚烧祭品，社稷坛的“五色土”象征天下疆域。",
        "extension": "可提及当代“城市双轴”规划中，如何借鉴这一理念平衡功能与文化。"
      },
      {
        "name": "四灵二十八宿",
        "definition": "古代天文学将星空分为“四象”（东青龙、西白虎、南朱雀、北玄武）与“二十八宿”，用于占卜与都城规划。",
        "application": "景山万春亭的观景台可观测“北斗七星”，其方位与中轴线对齐，暗合“紫微垣”（天帝居所）的象征意义。",
        "extension": "提供夜景观星图，引导游客寻找中轴线与星空的对应关系。"
      }
    ]
  },
  {
    "category": "现代保护与修复术语",
    "terms": [
      {
        "name": "最小干预原则",
        "definition": "文物保护的国际准则，强调修复时仅处理必要部分，保留历史痕迹，避免“过度修复”。",
        "application": "2023年正阳门箭楼修缮中，仅更换了3%的腐朽木构件，其余部分采用“灌浆加固”技术，最大限度保留原始结构。"
      }
    ]
  }
] 